provisioning/provisioning-impl/src/test/resources/attic/requests/getRequest01.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Copyright (c) 2011 Evolveum                             -->
<!--                                                         -->
<!-- The contents of this file are subject to the terms      -->
<!-- of the Common Development and Distribution License      -->
<!-- (the License). You may not use this file except in      -->
<!-- compliance with the License.                            -->
<!--                                                         -->
<!-- You can obtain a copy of the License at                 -->
<!-- http://www.opensource.org/licenses/cddl1 or             -->
<!-- CDDLv1.0.txt file in the source code distribution.      -->
<!-- See the License for the specific language governing     -->
<!-- permission and limitations under the License.           -->
<!--                                                         -->
<!-- If applicable, add the following below the CDDL Header, -->
<!-- with the fields enclosed by brackets [] replaced by     -->
<!-- your own identifying information:                       -->
<!--                                                         -->
<!-- Portions Copyrighted 2011 [name of copyright owner]     -->
<!--                                                         -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:prov="http://midpoint.evolveum.com/xml/ns/public/provisioning/provisioning-1.wsdl"
   xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
   xmlns:com='http://midpoint.evolveum.com/xml/ns/public/common/common-2a'
   
   xmlns:ics="http://midpoint.evolveum.com/xml/ns/public/resource/idconnector/resource-schema-2.xsd"
   xmlns:icc="http://midpoint.evolveum.com/xml/ns/public/resource/idconnector/configuration-1.xsd"
   xmlns:iccldap="http://midpoint.evolveum.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531"
   xmlns:dj="http://midpoint.evolveum.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soapenv:Header/>
    <soapenv:Body>
        <prov:getObject>
            <oid>ef2bc95b-13e0-48e2-86d6-3d4f02d3e13d</oid>
            <resolve>
                <com:property property="/__UID__"/>
                <com:property property="/__NAME__"/>
                <com:property property="/sn"/>
                <com:property property="/givenName"/>
                <com:property property="/groups"/>
                <com:property property="/description"/>
            </resolve>
            <result oid="?" type="?">
                <com:extension>
               <!--You may enter ANY elements at this point-->
                </com:extension>
                <!--Zero or more repetitions:-->
                <result oid="?" type="?">
                    <com:extension>
                    <!--You may enter ANY elements at this point-->
                    </com:extension>
                </result>
            </result>
        </prov:getObject>
    </soapenv:Body>
</soapenv:Envelope>
